Revit 2026 API

# MacroModule Class

---

A container for individual macros. As it relates to the macros editor, one MacroModule represents a project that can be loaded and edited from within the editor.

SystemObject Autodesk.Revit.DB.MacrosMacroModule

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MacroModule : IEnumerable<Macro>,
	IDisposable
```
```vb
Public Class MacroModule
	Implements IEnumerable(Of Macro), IDisposable
```
```cpp
public ref class MacroModule : IEnumerable<Macro^>,
	IDisposable
```
```fsharp
type MacroModule =
    class
        interface IEnumerable<Macro>
        interface IDisposable
    end
```

The MacroModule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Environment | The Macro environment. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroLanguageType | The Macro language type. |
|  | MacroManager | The Macro manager. |
|  | ModuleFolder | The module folder. |
|  | ModuleStatus | The module status. |
|  | Name | The name of the module. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MacroModule |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMacro | Gets the macro with the give name. |
|  | GetMacroModuleIterator | Returns a Macro module iterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Macros Namespace